#### Análisis de los tickets por Agente y Departamento

In [8]:
import os
from dotenv import load_dotenv
import pandas as pd
import numpy as np
import tkinter as tk
from tkcalendar import Calendar

load_dotenv()

%run conexionDB.ipynb

# Obtener la conexión
engine = obtener_conexion()

In [10]:
from datetime import datetime

# Fecha de inicio y salida a producción de la aplicación de soporte osTicket: 2 de febrero de 2019
fechaInicio = '2019-02-01'

# Fecha de fin: fecha actual (hoy)
fechaFin = datetime.now().strftime('%Y-%m-%d')

queryAgentes = f"""
SELECT tk.number, CONCAT(sta.firstname, ' ', sta.lastname) AS "Nombre Agente", sta.staff_id, tk.dept_id,
DATE_ADD(tk.created, INTERVAL -6 HOUR) as Creado
FROM ost_ticket AS tk
LEFT JOIN ost_staff AS sta ON tk.staff_id = sta.staff_id
WHERE DATE_ADD(tk.created, INTERVAL -6 HOUR) BETWEEN '{fechaInicio}' AND DATE_ADD('{fechaFin}', INTERVAL 1 DAY)
ORDER BY tk.created DESC
"""

# Imprimir la consulta para verificar
print(queryAgentes)
    
# Ejecutar la consulta y almacenar los resultados en la variable global
df_agentes = pd.read_sql(queryAgentes, engine)
df_agentes

SELECT tk.number, CONCAT(sta.firstname, ' ', sta.lastname) AS "Nombre Agente", sta.staff_id, tk.dept_id,
DATE_ADD(tk.created, INTERVAL -6 HOUR) as Creado
FROM ost_ticket AS tk
LEFT JOIN ost_staff AS sta ON tk.staff_id = sta.staff_id
WHERE DATE_ADD(tk.created, INTERVAL -6 HOUR) BETWEEN '2019-02-01' AND DATE_ADD('2025-01-17', INTERVAL 1 DAY)
ORDER BY tk.created DESC

       number        Nombre Agente  staff_id  dept_id              Creado
0      041208                 None       NaN        1 2025-01-17 09:22:33
1      041207         Leidy Santos      41.0        1 2025-01-17 09:08:55
2      041206                 None       NaN        2 2025-01-17 08:40:03
3      041205    Alan Stiven Gomez      14.0        1 2025-01-17 08:33:22
4      041204                 None       NaN        5 2025-01-17 08:22:13
...       ...                  ...       ...      ...                 ...
41187  000005         Mayoor Mappe      12.0        1 2019-02-06 15:00:22
41188  000004    Alan Stiven Gomez      14.0        1 2019-02-06 14:55:12
41189  000003  Infraestructura CCI      11.0        2 2019-02-06 14:26:51
41190  000002         Mayoor Mappe      12.0        1 2019-02-06 14:17:34
41191  000001    Alan Stiven Gomez      14.0        1 2019-02-06 12:25:51

[41192 rows x 5 columns]

#### Unificar TI 1 y TI 3, ya que ambos son del mismo departamento o área

In [11]:
# Reemplazar los valores de la columna "id" donde el valor sea 3 por 1
df_agentes.loc[df_agentes["dept_id"] == 3, "dept_id"] = 1
df_agentes

       number        Nombre Agente  staff_id  dept_id              Creado
0      041208                 None       NaN        1 2025-01-17 09:22:33
1      041207         Leidy Santos      41.0        1 2025-01-17 09:08:55
2      041206                 None       NaN        2 2025-01-17 08:40:03
3      041205    Alan Stiven Gomez      14.0        1 2025-01-17 08:33:22
4      041204                 None       NaN        5 2025-01-17 08:22:13
...       ...                  ...       ...      ...                 ...
41187  000005         Mayoor Mappe      12.0        1 2019-02-06 15:00:22
41188  000004    Alan Stiven Gomez      14.0        1 2019-02-06 14:55:12
41189  000003  Infraestructura CCI      11.0        2 2019-02-06 14:26:51
41190  000002         Mayoor Mappe      12.0        1 2019-02-06 14:17:34
41191  000001    Alan Stiven Gomez      14.0        1 2019-02-06 12:25:51

[41192 rows x 5 columns]